{
  "format": "layers-model",
  "generatedBy": "keras-converter",
  "convertedBy": null,
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential",
      "layers": [
        {
          "class_name": "Dense",
          "config": {
            "name": "dense",
            "trainable": true,
            "batch_input_shape": [null, 63],
            "dtype": "float32",
            "units": 128,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}},
            "bias_initializer": {"class_name": "Zeros", "config": {}},
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          }
        },
        {
          "class_name": "Dropout",
          "config": {
            "name": "dropout",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.3,
            "noise_shape": null,
            "seed": null
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_1",
            "trainable": true,
            "dtype": "float32",
            "units": 64,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}},
            "bias_initializer": {"class_name": "Zeros", "config": {}},
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          }
        },
        {
          "class_name": "Dropout",
          "config": {
            "name": "dropout_1",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.3,
            "noise_shape": null,
            "seed": null
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_2",
            "trainable": true,
            "dtype": "float32",
            "units": 29,
            "activation": "softmax",
            "use_bias": true,
            "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}},
            "bias_initializer": {"class_name": "Zeros", "config": {}},
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          }
        }
      ]
    },
    "keras_version": "2.15.0",
    "backend": "tensorflow"
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        {"name": "dense/kernel", "shape": [63, 128], "dtype": "float32"},
        {"name": "dense/bias", "shape": [128], "dtype": "float32"},
        {"name": "dense_1/kernel", "shape": [128, 64], "dtype": "float32"},
        {"name": "dense_1/bias", "shape": [64], "dtype": "float32"},
        {"name": "dense_2/kernel", "shape": [64, 29], "dtype": "float32"},
        {"name": "dense_2/bias", "shape": [29], "dtype": "float32"}
      ]
    }
  ]
}
